; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v10 ?v12)
             (pred_5 ?v11 ?v1)
             (pred_7 ?v10 ?v1)
             (pred_1 ?v13 ?v10 )
	     (pred_3 ?v10)
             (pred_6 ?v8)
             (pred_12 ?v11)
             (pred_2 ?v1)
             (pred_9 ?v10)
             (pred_11 ?v11)
             (pred_4 ?v10)
             (pred_10 ))



(:action op_5
:parameters (?v5 ?v3 ?v2 ?v6)
:precondition (and (pred_6 ?v5) (pred_6 ?v3) (pred_12 ?v2) (pred_2 ?v6)
          (pred_8 ?v5 ?v3) (pred_5 ?v2 ?v6)
                   (pred_7 ?v3 ?v6) (pred_3 ?v5) 
                   (pred_9 ?v3) (pred_11 ?v2))
:effect (and  (pred_4 ?v3) (not (pred_9 ?v3))))


(:action op_4
:parameters (?v5 ?v7)
:precondition (and (pred_6 ?v5) (pred_6 ?v7)
               (pred_3 ?v5) (pred_8 ?v5 ?v7) (pred_4 ?v7))
:effect (and (pred_3 ?v7) (not (pred_3 ?v5))))

(:action op_1
:parameters (?v5 ?v2)
:precondition (and (pred_6 ?v5) (pred_12 ?v2) 
                  (pred_3 ?v5) (pred_1 ?v2 ?v5) (pred_10 ))
:effect (and (pred_11 ?v2)
   (not (pred_1 ?v2 ?v5)) (not (pred_10 ))))


(:action op_3
:parameters (?v5 ?v4 ?v9)
:precondition (and (pred_6 ?v5) (pred_12 ?v4) (pred_12 ?v9)
                  (pred_3 ?v5) (pred_11 ?v9) (pred_1 ?v4 ?v5))
:effect (and (pred_11 ?v4) (pred_1 ?v9 ?v5)
        (not (pred_11 ?v9)) (not (pred_1 ?v4 ?v5))))

(:action op_2
:parameters (?v5 ?v2)
:precondition (and (pred_6 ?v5) (pred_12 ?v2) 
                  (pred_3 ?v5) (pred_11 ?v2))
:effect (and (pred_10 ) (pred_1 ?v2 ?v5) (not (pred_11 ?v2)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_26 obj_04 obj_10 obj_08 obj_09 obj_06 obj_14 obj_19 obj_15 obj_24 obj_27 obj_13 obj_01 obj_31 obj_29 obj_05 obj_17 obj_02 obj_22 obj_12 obj_21 obj_25 obj_11 obj_18 obj_23
    obj_28 obj_30 obj_20
    obj_07 obj_03 obj_16
    )

    (:init
       (pred_10)

       (pred_6 obj_26)
       (pred_6 obj_04)
       (pred_6 obj_10)
       (pred_6 obj_08)
       (pred_6 obj_09)
       (pred_6 obj_06)
       (pred_6 obj_14)
       (pred_6 obj_19)
       (pred_6 obj_15)
       (pred_6 obj_24)
       (pred_6 obj_27)
       (pred_6 obj_13)
       (pred_6 obj_01)
       (pred_6 obj_31)
       (pred_6 obj_29)
       (pred_6 obj_05)
       (pred_6 obj_17)
       (pred_6 obj_02)
       (pred_6 obj_22)
       (pred_6 obj_12)
       (pred_6 obj_21)
       (pred_6 obj_25)
       (pred_6 obj_11)
       (pred_6 obj_18)
       (pred_6 obj_23)
       (pred_2 obj_28)
       (pred_2 obj_30)
       (pred_2 obj_20)
       (pred_12 obj_07)
       (pred_12 obj_03)
       (pred_12 obj_16)

       (pred_8 obj_26 obj_06)
       (pred_8 obj_26 obj_04)
       (pred_8 obj_04 obj_14)
       (pred_8 obj_04 obj_10)
       (pred_8 obj_04 obj_26)
       (pred_8 obj_10 obj_19)
       (pred_8 obj_10 obj_08)
       (pred_8 obj_10 obj_04)
       (pred_8 obj_08 obj_15)
       (pred_8 obj_08 obj_09)
       (pred_8 obj_08 obj_10)
       (pred_8 obj_09 obj_24)
       (pred_8 obj_09 obj_08)
       (pred_8 obj_06 obj_27)
       (pred_8 obj_06 obj_14)
       (pred_8 obj_06 obj_26)
       (pred_8 obj_14 obj_13)
       (pred_8 obj_14 obj_19)
       (pred_8 obj_14 obj_04)
       (pred_8 obj_14 obj_06)
       (pred_8 obj_19 obj_01)
       (pred_8 obj_19 obj_15)
       (pred_8 obj_19 obj_10)
       (pred_8 obj_19 obj_14)
       (pred_8 obj_15 obj_31)
       (pred_8 obj_15 obj_24)
       (pred_8 obj_15 obj_08)
       (pred_8 obj_15 obj_19)
       (pred_8 obj_24 obj_29)
       (pred_8 obj_24 obj_09)
       (pred_8 obj_24 obj_15)
       (pred_8 obj_27 obj_05)
       (pred_8 obj_27 obj_13)
       (pred_8 obj_27 obj_06)
       (pred_8 obj_13 obj_17)
       (pred_8 obj_13 obj_01)
       (pred_8 obj_13 obj_14)
       (pred_8 obj_13 obj_27)
       (pred_8 obj_01 obj_02)
       (pred_8 obj_01 obj_31)
       (pred_8 obj_01 obj_19)
       (pred_8 obj_01 obj_13)
       (pred_8 obj_31 obj_22)
       (pred_8 obj_31 obj_29)
       (pred_8 obj_31 obj_15)
       (pred_8 obj_31 obj_01)
       (pred_8 obj_29 obj_12)
       (pred_8 obj_29 obj_24)
       (pred_8 obj_29 obj_31)
       (pred_8 obj_05 obj_21)
       (pred_8 obj_05 obj_17)
       (pred_8 obj_05 obj_27)
       (pred_8 obj_17 obj_25)
       (pred_8 obj_17 obj_02)
       (pred_8 obj_17 obj_13)
       (pred_8 obj_17 obj_05)
       (pred_8 obj_02 obj_11)
       (pred_8 obj_02 obj_22)
       (pred_8 obj_02 obj_01)
       (pred_8 obj_02 obj_17)
       (pred_8 obj_22 obj_18)
       (pred_8 obj_22 obj_12)
       (pred_8 obj_22 obj_31)
       (pred_8 obj_22 obj_02)
       (pred_8 obj_12 obj_23)
       (pred_8 obj_12 obj_29)
       (pred_8 obj_12 obj_22)
       (pred_8 obj_21 obj_25)
       (pred_8 obj_21 obj_05)
       (pred_8 obj_25 obj_11)
       (pred_8 obj_25 obj_17)
       (pred_8 obj_25 obj_21)
       (pred_8 obj_11 obj_18)
       (pred_8 obj_11 obj_02)
       (pred_8 obj_11 obj_25)
       (pred_8 obj_18 obj_23)
       (pred_8 obj_18 obj_22)
       (pred_8 obj_18 obj_11)
       (pred_8 obj_23 obj_12)
       (pred_8 obj_23 obj_18)
       (pred_9 obj_21)
       (pred_9 obj_09)
       (pred_9 obj_02)
       (pred_7  obj_21 obj_28)
       (pred_7  obj_09 obj_30)
       (pred_7  obj_02 obj_20)
       (pred_4 obj_26)
       (pred_4 obj_04)
       (pred_4 obj_10)
       (pred_4 obj_08)
       (pred_4 obj_06)
       (pred_4 obj_14)
       (pred_4 obj_19)
       (pred_4 obj_15)
       (pred_4 obj_24)
       (pred_4 obj_27)
       (pred_4 obj_13)
       (pred_4 obj_01)
       (pred_4 obj_31)
       (pred_4 obj_29)
       (pred_4 obj_05)
       (pred_4 obj_17)
       (pred_4 obj_22)
       (pred_4 obj_12)
       (pred_4 obj_25)
       (pred_4 obj_11)
       (pred_4 obj_18)
       (pred_4 obj_23)

       (pred_5  obj_07 obj_28)
       (pred_5  obj_03 obj_30)
       (pred_5  obj_16 obj_20)
       (pred_1 obj_07 obj_31)
       (pred_1 obj_03 obj_26)
       (pred_1 obj_16 obj_23)
       (pred_3 obj_25)
    )

    (:goal (and
       (pred_1 obj_07 obj_25)
    ))
(:constraints
  (always (not (pred_3 obj_17)))
)
)

; plan
1. (op_4 obj_25 obj_11)
   deleted: (pred_3 obj_25)
   added: (pred_3 obj_11)
   goals met: 0 of 1
2. (op_4 obj_11 obj_18)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_18)
   goals met: 0 of 1
3. (op_4 obj_18 obj_22)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_22)
   goals met: 0 of 1
4. (op_4 obj_22 obj_31)
   deleted: (pred_3 obj_22)
   added: (pred_3 obj_31)
   goals met: 0 of 1
5. (op_1 obj_31 obj_07)
   deleted: (pred_1 obj_07 obj_31) (pred_10)
   added: (pred_11 obj_07)
   goals met: 0 of 1
6. (op_4 obj_31 obj_22)
   deleted: (pred_3 obj_31)
   added: (pred_3 obj_22)
   goals met: 0 of 1
7. (op_4 obj_22 obj_18)
   deleted: (pred_3 obj_22)
   added: (pred_3 obj_18)
   goals met: 0 of 1
8. (op_4 obj_18 obj_11)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_11)
   goals met: 0 of 1
9. (op_4 obj_11 obj_25)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_25)
   goals met: 0 of 1
10. (op_2 obj_25 obj_07)
   deleted: (pred_11 obj_07)
   added: (pred_10) (pred_1 obj_07 obj_25)
   goals met: 1 of 1
